# GetFillGrids Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillPattern..::..GetFillGrids Method
FillPattern Class See Also
---
Gets all fill grids in this fill pattern
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<FillGrid> GetFillGrids()
```

Visual Basic
---
```text
Public Function GetFillGrids As IList(Of FillGrid)
```

Visual C++
---
```text
public:
IList<FillGrid^>^ GetFillGrids()
```

# ### Return Value
The fill grids.
# See Also
FillPattern Class
Autodesk.Revit.DB Namespace